app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if(@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "fuck_post_1"], ["user_id", 1], ["created_at", "2016-08-31 09:22:04.924669"], ["updated_at", "2016-08-31 09:22:04.924669"]]